Autodesk.Revit.DB.BuiltInFailures.CurveByPointFailures.UnableToGenerateCurve
Unable to generate valid curve geometry from the driving points.  The line by points will be dissolved.

Autodesk.Revit.DB.BuiltInFailures.CurveByPointFailures
Failures about Curve By Point Element